https://leetcode.com/problems/find-followers-count/

In [13]:
import pandas as pd
import numpy as np 
import sqlite3

In [14]:
sql = '''
Create table If Not Exists Followers(user_id int, follower_id int);
---Truncate table Followers
insert into Followers (user_id, follower_id) values ('0', '1');
insert into Followers (user_id, follower_id) values ('1', '0');
insert into Followers (user_id, follower_id) values ('2', '0');
insert into Followers (user_id, follower_id) values ('2', '1');
'''

In [15]:
def select(sql):
    return pd.read_sql(sql, con)

In [16]:
con = sqlite3.connect('db')

In [17]:
cur = con.cursor()

In [18]:
cur.executescript(sql)

In [19]:
sql = '''
SELECT *
FROM Followers AS t
'''

In [20]:
select(sql)

   user_id  follower_id
0        0            1
1        1            0
2        2            0
3        2            1
4        0            1
5        1            0
6        2            0
7        2            1

In [21]:
sql = '''
SELECT t.user_id, 
   count(1) AS followers_count
FROM Followers AS t
'''

In [22]:
select(sql)

   user_id  followers_count
0        0                8

In [23]:
sql = '''
SELECT t.user_id, 
   count(1) AS followers_count
FROM Followers AS t
GROUP BY t.user_id
ORDER BY t.user_id
'''

In [24]:
select(sql)

   user_id  followers_count
0        0                2
1        1                2
2        2                4